# 任务：优化现有 Streamlit 项目针对deepseek的两个核心模块

我已有基础版本，现在需要修改以下两个部分，请只针对这些部分提供代码修改，不要重写整个项目。

## 修改点 1：MD 解析与渲染优化

**当前问题**：用户复制进来的内容是md格式文本，你需要对它做解析，删除无用的文字部分，保留有用信息。并且根据提示区分ai和用户。



**修改要求**：
1. 解析 `## User` / `## Assistant` 切分对话时，保留内容的原始 Markdown 格式
2. 在 Streamlit 中渲染时：
   - User 消息：直接 `st.markdown(content)`
   - Assistant 消息：先用代码块识别函数解析，对文本部分用 `st.markdown` 渲染，代码块用 `st.code` 渲染
3. 确保 `**粗体**`、`*斜体*`、`- 列表`、`1. 有序列表`、`### 标题` 等 Markdown 语法能正确显示

示例（注意，前面有一些信息，只选择需要的，有时候可能会导出一些其他的信息，此处没展示，视为忽略）：
---
title: "用户问候助手回应 - DeepSeek"
date: "2026-04-09T02:56:56.726Z"
url: "https://chat.deepseek.com/a/chat/s/bf57d03e-d698-46cd-a15b-2b8bf3f115fb"
platform: "deepseek"
message_count: 4
用户问候助手回应 - DeepSeek (4 消息)
🔗 原始链接: https://chat.deepseek.com/a/chat/s/bf57d03e-d698-46cd-a15b-2b8bf3f115fb
📅 导出时间: 2026-04-09T02:56:56.726Z
> **统计**
> - **消息**: 4 (2 用户, 2 助手)
> - **字数**: ~244 (~1 分钟阅读)
> - **代码块**: 2

---
<a id="message-1"></a>
👤 用户
🕐 2026-04-09T02:56:56.726Z | #1 | 轮次 1
> hi
---
<a id="message-2"></a>
🤖 deepseek
🕐 2026-04-09T02:56:56.726Z | #2
你好！👋 很高兴见到你！
有什么我可以帮你的吗？无论是聊天、回答问题、写作、翻译、编程，还是帮你整理思路或处理文档，我都很乐意协助。直接告诉我就好！
---
<a id="message-3"></a>
👤 用户
🕐 2026-04-09T02:56:56.726Z | #3 | 轮次 2
> 来段简单的代码
---
<a id="message-4"></a>
🤖 deepseek
🕐 2026-04-09T02:56:56.726Z | #4
好的，给你一段简单实用的 Python 代码：判断一个数是否为质数。
python
def is_prime(n):
"""判断一个整数是否为质数"""
if n <= 1:
return False
if n <= 3:
return True
if n % 2 == 0 or n % 3 == 0:
return False
    i \= 5
    while i \* i <= n:
        if n % i \== 0 or n % (i + 2) \== 0:
            return False
        i += 6
    return True

# 测试一下
num = 29
if is_prime(num):
print(f"{num} 是质数")
else:
print(f"{num} 不是质数")
运行结果：
text
29 是质数
如果你想看其他类型的简单代码（比如排序、爬虫、小游戏等），随时告诉我！😊
---

由 NousSave Ai Chat Exporter 生成 | deepseek | 2026/4/9

（示例结束）

## 修改点 2：代码块识别函数替换

**当前问题**：有些ai大模型的md是有代码格式的，但是有的没有。现有代码块识别逻辑不够健壮，无法处理扩展导出的特殊格式。
比如，有的是这样：

你好，这是一段最简单的 Python “Hello World” 代码：
Python
print("Hello, World!")
运行后，程序会在屏幕上输出。

有的是这样：
这是最简洁的写法，通常用于脚本编写和数据分析。
```

1print("Hello, World!")

```


**修改要求**：
没有代码格式的代码单元格md的特点是会在代码格前标注语言。请将我现有的代码块识别函数**修改**为以下逻辑（可以参考）：


---

### 🔧 修复函数（针对这种特定格式）

```python
import re

def fix_missing_code_fences(content: str) -> str:
    """
    修复扩展导出时丢失的代码块标记
    特征：语言名单独一行（如 python），下一行开始是缩进代码
    """
    lines = content.split('\n')
    result = []
    i = 0
    
    while i < len(lines):
        line = lines[i]
        
        # 检测语言标识行（如单独的 "python"、"javascript"、"html"）
        lang_match = re.match(r'^\s*(python|javascript|java|cpp|html|css|bash|sql|json|yaml)\s*$', line, re.IGNORECASE)
        
        if lang_match:
            lang = lang_match.group(1).lower()
            # 检查下一行是否以缩进开头（代码块开始）
            if i + 1 < len(lines) and (lines[i+1].startswith('    ') or lines[i+1].startswith('\t')):
                result.append(f'```{lang}')
                
                # 收集所有连续的缩进行
                i += 1
                while i < len(lines) and (lines[i].startswith('    ') or lines[i].startswith('\t') or lines[i].strip() == ''):
                    # 去掉一层缩进（4空格或1Tab）
                    if lines[i].startswith('    '):
                        result.append(lines[i][4:])
                    elif lines[i].startswith('\t'):
                        result.append(lines[i][1:])
                    else:
                        result.append(lines[i])
                    i += 1
                
                result.append('```')
                continue  # 已经处理了代码块，跳过常规添加
        else:
            result.append(line)
            i += 1
    
    return '\n'.join(result)
**集成要点**：
- 这个函数应在解析 Assistant 消息内容时调用
- 返回的列表结构为 `[{'type': 'text', 'content': '...'}, {'type': 'code', 'lang': '...', 'content': '...'}]`
- 渲染 Assistant 消息时，遍历这个列表，根据 `type` 分别用 `st.markdown` 和 `st.code` 渲染

## 输出格式

请提供：
1. 需要修改的函数/代码块的完整新版本
2. 简要说明在现有项目的哪个文件/位置进行替换
3. 如果涉及新增 import，请列出

不要输出完整项目代码，只输出修改部分。